"1 84 1 4206624772 ,"
"input 4 1 3 120 120 0 ,"
" 167 170 173 176 179 182 185 188 191 194 197 200 203 206 209 212 215 218 221 224 227 230 233 236 239 242 245 246 247 249 251 253 254 255 257 259 260 262 263 264 265 267 268 270 271 273 275 277 279 280 282 283 284 285 287 290 293 296 299 302 305 308 311 314 317 320 323 326 329 332 335 338 341 344 347 350 353 356 359 362 365 368 input output ,"
"output ,"
" 82 ,"
"Convolution Conv_0 1 1 input 287 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_1 1 1 287 167 ,"
"Convolution Conv_2 1 1 167 290 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_3 1 1 290 170 ,"
"Convolution Conv_4 1 1 170 293 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_5 1 1 293 173 ,"
"Convolution Conv_6 1 1 173 296 64 1 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_7 1 1 296 176 ,"
"Convolution Conv_8 1 1 176 299 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_9 1 1 299 179 ,"
"Convolution Conv_10 1 1 179 302 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_11 1 1 302 182 ,"
"Convolution Conv_12 1 1 182 305 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_13 1 1 305 185 ,"
"Convolution Conv_14 1 1 185 308 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_15 1 1 308 188 ,"
"Convolution Conv_16 1 1 188 311 1 128 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_17 1 1 311 191 ,"
"Convolution Conv_18 1 1 191 314 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_19 1 1 314 194 ,"
"Convolution Conv_20 1 1 194 317 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_21 1 1 317 197 ,"
"Convolution Conv_22 1 1 197 320 256 1 256 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_23 1 1 320 200 ,"
"Convolution Conv_24 1 1 200 323 1 256 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_25 1 1 323 203 ,"
"Convolution Conv_26 1 1 203 326 512 1 512 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_27 1 1 326 206 ,"
"Convolution Conv_28 1 1 206 329 1 512 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_29 1 1 329 209 ,"
"Convolution Conv_30 1 1 209 332 512 1 512 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_31 1 1 332 212 ,"
"Convolution Conv_32 1 1 212 335 1 512 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_33 1 1 335 215 ,"
"Convolution Conv_34 1 1 215 338 512 1 512 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_35 1 1 338 218 ,"
"Convolution Conv_36 1 1 218 341 1 512 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_37 1 1 341 221 ,"
"Convolution Conv_38 1 1 221 344 512 1 512 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_39 1 1 344 224 ,"
"Convolution Conv_40 1 1 224 347 1 512 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_41 1 1 347 227 ,"
"Convolution Conv_42 1 1 227 350 512 1 512 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_43 1 1 350 230 ,"
"Convolution Conv_44 1 1 230 353 1 512 512 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_45 1 1 353 233 ,"
"Convolution Conv_46 1 1 233 356 512 1 512 3 3 2 2 1 1 1 -1 1 1 0 ,"
"ReLU Relu_47 1 1 356 236 ,"
"Convolution Conv_48 1 1 236 359 1 512 1024 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_49 1 1 359 239 ,"
"Convolution Conv_50 1 1 239 362 1024 1 1024 3 3 1 1 1 1 1 -1 1 1 0 ,"
"ReLU Relu_51 1 1 362 242 ,"
"Convolution Conv_52 1 1 242 365 1 1024 1024 1 1 1 1 0 0 1 -1 1 1 0 ,"
"ReLU Relu_53 1 1 365 245 ,"
"Pooling GlobalAveragePool_54 1 1 245 246 1 0 0 1 1 0 0 -1 -1 -1 0 0 -1 -1 ,"
"Shape Shape_55 1 1 246 247 ,"
"Gather Gather_57 1 1 247 249 0 0 1 ,"
"Unsqueeze Unsqueeze_58 1 1 249 251 1 0 ,"
"Concat Concat_59 2 1 251 368 253 0 ,"
"Reshape Reshape_60 2 1 246 253 254 0 2 2 0 -1 0 ,"
"InnerProduct Gemm_61 1 1 254 255 62 1 0 1 ,"
"Mul Mul_63 1 1 255 257 1 ,"
"Add Add_65 1 1 257 259 1 ,"
"StridedSliceV2 Slice_66 1 1 259 260 1 0 1 12 1 1 1 1 ,"
"Reshape Reshape_68 1 1 260 262 0 2 2 3 -1 0 ,"
"StridedSliceV2 Slice_69 1 1 262 263 1 0 1 3 1 1 1 1 ,"
"StridedSliceV2 Slice_70 1 1 262 264 1 -1 1 2147483647 1 1 1 1 ,"
"Squeeze Squeeze_71 1 1 264 265 1 1 ,"
"Reshape Reshape_73 1 1 265 267 0 2 2 0 -1 0 ,"
"StridedSliceV2 Slice_74 1 1 259 268 1 12 1 52 1 1 1 1 ,"
"Reshape Reshape_76 1 1 268 270 0 2 2 -1 1 0 ,"
"StridedSliceV2 Slice_77 1 1 259 271 1 52 1 2147483647 1 1 1 1 ,"
"Reshape Reshape_79 1 1 271 273 0 2 2 -1 1 0 ,"
"MatMul MatMul_81 1 1 270 275 0 ,"
"Add Add_83 1 1 275 277 0 ,"
"MatMul MatMul_85 1 1 273 279 0 ,"
"Add Add_86 2 1 277 279 280 1 ,"
"Reshape Reshape_88 1 1 280 282 0 2 2 -1 3 0 ,"
"Permute Transpose_89 1 1 282 283 2 1 0 ,"
"MatMul MatMul_90 2 1 263 283 284 -1 ,"
"Add Add_91 2 1 284 267 285 1 ,"
"Permute Transpose_92 1 1 285 output 2 1 0 ,"
